"""
Матрица 4×4 задаётся кортежем из 4 кортежей по 4 целых числа в каждом.
Написать функцию det4(r0, r1, r2, r3),
вычисляющую точный определитель матрицы (r0, r1, r2, r3).
"""


import math
def det4(r0, r1, r2, r3):
    sum = 0
    sum += r0[0]*pow(-1,2)*(r1[1]*(r2[2]*r3[3]-r2[3]*r3[2])-r1[2]*(r2[1]*r3[3]-r2[3]*r3[1])+r1[3]*(r2[1]*r3[2]-r2[2]*r3[1]))
    sum += r0[1]*pow(-1,3)*(r1[0]*(r2[2]*r3[3]-r2[3]*r3[2])-r1[2]*(r2[0]*r3[3]-r2[3]*r3[0])+r1[3]*(r2[0]*r3[2]-r2[2]*r3[0]))
    sum += r0[2]*pow(-1,4)*(r1[0]*(r2[1]*r3[3]-r2[3]*r3[1])-r1[1]*(r2[0]*r3[3]-r2[3]*r3[0])+r1[3]*(r2[0]*r3[1]-r2[1]*r3[0]))
    sum += r0[3]*pow(-1,5)*(r1[0]*(r2[1]*r3[2]-r2[2]*r3[1])-r1[1]*(r2[0]*r3[2]-r2[2]*r3[0])+r1[2]*(r2[0]*r3[1]-r2[1]*r3[0]))
    return sum

